{
  "title": "Magical Blossom Harvest",
  "stem_md": "In the heart of the Enchanted Garden, the gnomes tend to **13 unique magical blossoms**—each type representing a different rank (like kings, queens, etc.). Four blossoms are of the **royal kind** (Knight’s Crest, Queen’s Bloom, and Jack’s Thorn), while the rest are common blooms. The garden’s caretaker picks blossoms one by one until the rare **Heart’s Whisper** (analogous to the two of hearts) is found. \n\nWhat is the probability that **exactly one of each royal blossom** (Knight’s Crest, Queen’s Bloom, and Jack’s Thorn) appears before the Heart’s Whisper? Assume the garden’s order is perfectly randomized.",
  "hints": [
    "Focus only on the **13 relevant blossoms** (royal types + Heart’s Whisper). Ignore the rest.",
    "Think stepwise: First pick any royal blossom, then a *different* royal type, then the last remaining royal type, and finally Heart’s Whisper.",
    "Alternatively, count valid sequences: 3! ways to order the royal blossoms, multiplied by choices for each type (4³), and divide by total possible sequences (13·12·11·10)."
  ],
  "detailed_solution_md": "### Step 1: Simplify the Scenario\nOnly **13 blossoms matter**: 12 royal (4 Knight’s Crests, 4 Queen’s Blooms, 4 Jack’s Thorns) and 1 Heart’s Whisper. The other blossoms don’t affect the outcome.\n\n### Step 2: Sequential Probability Approach\nWe need **one of each royal blossom** before Heart’s Whisper. Let’s compute the probability step by step:\n\n1. **First pick**: Any royal blossom. Probability = $\\frac{12}{13}$ (12 royal out of 13).\n2. **Second pick**: A *different* royal type. Now 8 valid blossoms remain (e.g., if first was Knight’s Crest, next must be Queen’s Bloom or Jack’s Thorn). Probability = $\\frac{8}{12}$.\n3. **Third pick**: The last remaining royal type. Now 4 valid blossoms left (e.g., if first two were Knight’s Crest and Queen’s Bloom, next must be Jack’s Thorn). Probability = $\\frac{4}{11}$.\n4. **Fourth pick**: Heart’s Whisper. Exactly 1 valid blossom remains. Probability = $\\frac{1}{10}$.\n\nMultiply these probabilities:\n$$\\frac{12}{13} \\cdot \\frac{8}{12} \\cdot \\frac{4}{11} \\cdot \\frac{1}{10} = \\frac{16}{715}.$$\n\n### Step 3: Combinatorial Approach\nCount valid sequences where the first three blossoms are one of each royal type (in any order), followed by Heart’s Whisper:\n\n1. **Order the royal blossoms**: 3! permutations (KQJ, KJQ, QKJ, QJK, JKQ, JQK).\n2. **Choose suits**: 4 choices for each royal type (since there are 4 of each). Total = $3! \\times 4^3 = 6 \\times 64 = 384$.\n3. **Total possible sequences** for first four blossoms: $13 \\times 12 \\times 11 \\times 10 = 17160$.\n\nProbability:\n$$\\frac{384}{17160} = \\frac{16}{715}.$$\n\n**Final Answer**: The probability is $\\boxed{\\dfrac{16}{715}}$.",
  "topic": "probability",
  "difficulty": "medium"
}